In [1]:
import pandas as pd

In [4]:
dic = {'Name':['Shah','Vats','Vats','Kumar','Vats','Kumar','Shah','Shah','Kumar','Vats'],
      'Gender':['Male','Male','Female','Female','Female','Male','Male','Female','Female','Male'],
      'MonthlyIncome (Rs.)':[114000.00,65000.00,43150.00,69500.00,155000.00,103000.00,55000.00,112400.00,81030.00,71900.00]}
df = pd.DataFrame(dic)
display(df)

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
2   Vats  Female              43150.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
6   Shah    Male              55000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [6]:
gross_income = df.groupby('Name')['MonthlyIncome (Rs.)'].mean()
print('Gross Income\n',gross_income)

Gross Income
 Name
Kumar    84510.0
Shah     93800.0
Vats     83762.5
Name: MonthlyIncome (Rs.), dtype: float64

In [32]:
temp = df.groupby('Name').idxmax().reset_index()
print(df.loc[temp['MonthlyIncome (Rs.)']].reset_index().drop('index',axis=1))

    Name  Gender  MonthlyIncome (Rs.)
0  Kumar    Male             103000.0
1   Shah    Male             114000.0
2   Vats  Female             155000.0

In [14]:
print('Income of all members > 60k\n')
display(df[df['MonthlyIncome (Rs.)'] > 60000.00].reset_index())

Income of all members > 60k

   index   Name  Gender  MonthlyIncome (Rs.)
0      0   Shah    Male             114000.0
1      1   Vats    Male              65000.0
2      3  Kumar  Female              69500.0
3      4   Vats  Female             155000.0
4      5  Kumar    Male             103000.0
5      7   Shah  Female             112400.0
6      8  Kumar  Female              81030.0
7      9   Vats    Male              71900.0

In [44]:
avg_income_f = df.where((df['Gender'] == 'Female') & (df['Name'] == 'Shah')).dropna()
avg_income_f['MonthlyIncome (Rs.)'].mean()

112400.0